In [1]:
import pandas as pd
df =pd.read_csv('Adops & Data Scientist Sample Data - Q1 Analytics.csv')

In [2]:
df.head()

                    ts user_id country_id site_id
0  2019-02-01 00:01:24  LC36FC        TL6   N0OTG
1  2019-02-01 00:10:19  LC39B6        TL6   N0OTG
2  2019-02-01 00:21:50  LC3500        TL6   N0OTG
3  2019-02-01 00:22:50  LC374F        TL6   N0OTG
4  2019-02-01 00:23:44  LCC1C3        TL6   QGO3G

In [3]:
q1 = df.loc[df['country_id']=='BDV']

In [4]:
q1_group = q1.groupby('site_id').nunique()

In [5]:
q1_group

          ts  user_id  country_id  site_id
site_id
3POLC      5        2           1        1
5NPAU    716      544           1        1
N0OTG    122       90           1        1

In [6]:
# 5NPAU has the most site ids with 716

In [7]:
dates= pd.to_datetime(df['ts'])

In [8]:
dates

0      2019-02-01 00:01:24
1      2019-02-01 00:10:19
2      2019-02-01 00:21:50
3      2019-02-01 00:22:50
4      2019-02-01 00:23:44
               ...
3548   2019-02-07 23:56:57
3549   2019-02-07 23:58:36
3550   2019-02-07 23:58:56
3551   2019-02-07 23:59:19
3552   2019-02-07 23:59:37
Name: ts, Length: 3553, dtype: datetime64[ns]

In [9]:
df['ts'] =dates

In [10]:
q2 = df.set_index('ts')

In [11]:
q2 = q2.loc['2019-02-03 00:00:00':'2019-02-04 23:59:59']

In [12]:
q2

                    user_id country_id site_id
ts
2019-02-03 00:02:31  LC3C7E        TL6   3POLC
2019-02-03 00:03:09  LC3C7E        TL6   3POLC
2019-02-03 00:03:46  LC3C7E        TL6   3POLC
2019-02-03 00:04:12  LC3C7E        TL6   3POLC
2019-02-03 00:04:25  LC3C7E        TL6   3POLC
...                     ...        ...     ...
2019-02-04 23:54:56  LC34B0        XA7   N0OTG
2019-02-04 23:55:46  LC3DEA        TL6   N0OTG
2019-02-04 23:56:12  LC06C3        TL6   N0OTG
2019-02-04 23:56:54  LC06C3        TL6   N0OTG
2019-02-04 23:57:03  LC06C3        TL6   N0OTG

[1031 rows x 3 columns]

In [13]:
q2_answ = q2.groupby(['user_id']).count()

In [14]:
q2_answ

         country_id  site_id
user_id
LC00C3            1        1
LC01C3            1        1
LC06C3           26       26
LC0C3E            1        1
LC13C3            1        1
...             ...      ...
LCDFC3            1        1
LCE2C3            3        3
LCE4C3            1        1
LCFC32            1        1
LCFFC3            1        1

[708 rows x 2 columns]

In [15]:
q2_answ = q2_answ.loc[q2_answ['site_id']>10]

In [16]:
people = q2_answ.index

In [17]:
people

Index(['LC06C3', 'LC3A59', 'LC3C7E', 'LC3C9D'], dtype='object', name='user_id')

In [18]:
q2_answer = q2.loc[q2['user_id'].isin(people)]

In [19]:
#answer : 
#LC06C3 N0OTG 25
#LC3A59 N0OTG 26
#LC3C7E 3POLC 15
#LC3C9D N0OTG 17

In [20]:
for i in people:
    x = q2_answer.loc[q2_answer['user_id']==i]
    print(i)
    print(x['site_id'].value_counts())

LC06C3
N0OTG    25
GVOFK     1
Name: site_id, dtype: int64
LC3A59
N0OTG    26
Name: site_id, dtype: int64
LC3C7E
3POLC    15
Name: site_id, dtype: int64
LC3C9D
N0OTG    17
GVOFK     1
Name: site_id, dtype: int64

In [21]:
df =df.sort_values(by=['ts'])

In [22]:
last_visit ={}
for i in df['user_id'].unique():
    x = df.loc[df['user_id']==i]
    last_visit.update({i:x['site_id'].iloc[-1]})

In [24]:
from collections import Counter
Counter(last_visit.values()).most_common(3)

[('5NPAU', 992), ('N0OTG', 561), ('QGO3G', 289)]

In [25]:
#answer : [('5NPAU', 992), ('N0OTG', 561), ('QGO3G', 289)]

In [26]:
first_visit ={}
for i in df['user_id'].unique():
    x = df.loc[df['user_id']==i]
    first_visit.update({i:x['site_id'].iloc[0]})

In [27]:
answer= []
for keys,values in first_visit.items():
    for k,v in last_visit.items():
        if keys==k:
            if values ==v:
                answer.append(k)

In [28]:
#answer = 1670

In [29]:
len(set(answer))

1670

In [30]:
#checking why this number is so high

In [31]:
len(df['user_id'].unique())

1916

In [32]:
df= df.loc[df['user_id'].isin(answer)]

In [33]:
df.groupby('user_id').nunique().mean()

ts            1.716766
user_id       1.000000
country_id    1.067066
site_id       1.026347
dtype: float64

In [ ]:
#found out people only visited 1 normally